benchmark-results/optimized-rust-get-by-id-heavy.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/get-by-id-heavy.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 1698 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m00.4s/1m0s

running (0m02.0s), 100/100 VUs, 6312 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.4s/1m0s

running (0m03.0s), 100/100 VUs, 11052 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m02.4s/1m0s

running (0m04.0s), 100/100 VUs, 15763 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m03.4s/1m0s

running (0m05.0s), 100/100 VUs, 20412 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.4s/1m0s

running (0m06.0s), 100/100 VUs, 25117 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m05.4s/1m0s

running (0m07.0s), 100/100 VUs, 29912 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m06.4s/1m0s

running (0m08.0s), 100/100 VUs, 34568 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.4s/1m0s

running (0m09.0s), 100/100 VUs, 39268 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m08.4s/1m0s

running (0m10.0s), 100/100 VUs, 44068 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m09.4s/1m0s

running (0m11.0s), 100/100 VUs, 48768 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.4s/1m0s

running (0m12.0s), 100/100 VUs, 53468 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m11.4s/1m0s

running (0m13.0s), 100/100 VUs, 58175 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m12.4s/1m0s

running (0m14.0s), 100/100 VUs, 62875 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.4s/1m0s

running (0m15.0s), 100/100 VUs, 67663 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m14.4s/1m0s

running (0m16.0s), 100/100 VUs, 72375 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m15.4s/1m0s

running (0m17.0s), 100/100 VUs, 77006 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.4s/1m0s

running (0m18.0s), 100/100 VUs, 81706 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m17.4s/1m0s

running (0m19.0s), 100/100 VUs, 86506 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m18.4s/1m0s

running (0m20.0s), 100/100 VUs, 91161 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.4s/1m0s

running (0m21.0s), 100/100 VUs, 95908 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m20.4s/1m0s

running (0m22.0s), 100/100 VUs, 100608 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m21.4s/1m0s

running (0m23.0s), 100/100 VUs, 105408 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.4s/1m0s

running (0m24.0s), 100/100 VUs, 110108 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m23.4s/1m0s

running (0m25.0s), 100/100 VUs, 114875 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m24.4s/1m0s

running (0m26.0s), 100/100 VUs, 119608 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.4s/1m0s

running (0m27.0s), 100/100 VUs, 124308 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m26.4s/1m0s

running (0m28.0s), 100/100 VUs, 129016 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m27.4s/1m0s

running (0m29.0s), 100/100 VUs, 133731 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.4s/1m0s

running (0m30.0s), 100/100 VUs, 138481 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m29.4s/1m0s

running (0m31.0s), 100/100 VUs, 143208 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  0m30.4s/1m0s

running (0m32.0s), 100/100 VUs, 147906 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.4s/1m0s

running (0m33.0s), 100/100 VUs, 152682 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  0m32.4s/1m0s

running (0m34.0s), 100/100 VUs, 157406 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  0m33.4s/1m0s

running (0m35.0s), 100/100 VUs, 162106 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.4s/1m0s

running (0m36.0s), 100/100 VUs, 166813 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  0m35.4s/1m0s

running (0m37.0s), 100/100 VUs, 171513 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  0m36.4s/1m0s

running (0m38.0s), 100/100 VUs, 176232 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.4s/1m0s

running (0m39.0s), 100/100 VUs, 180964 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  0m38.4s/1m0s

running (0m40.0s), 100/100 VUs, 185664 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  0m39.4s/1m0s

running (0m41.0s), 100/100 VUs, 190315 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.4s/1m0s

running (0m42.0s), 100/100 VUs, 195046 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  0m41.4s/1m0s

running (0m43.0s), 100/100 VUs, 199766 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  0m42.4s/1m0s

running (0m44.0s), 100/100 VUs, 204466 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.4s/1m0s

running (0m45.0s), 100/100 VUs, 209167 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  0m44.4s/1m0s

running (0m46.0s), 100/100 VUs, 213966 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  0m45.4s/1m0s

running (0m47.0s), 100/100 VUs, 218666 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.4s/1m0s

running (0m48.0s), 100/100 VUs, 223376 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  0m47.4s/1m0s

running (0m49.0s), 100/100 VUs, 228176 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  0m48.4s/1m0s

running (0m50.0s), 100/100 VUs, 232876 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.4s/1m0s

running (0m51.0s), 100/100 VUs, 237676 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  0m50.4s/1m0s

running (0m52.0s), 100/100 VUs, 242376 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  0m51.4s/1m0s

running (0m53.0s), 100/100 VUs, 247176 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.4s/1m0s

running (0m54.0s), 100/100 VUs, 251876 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  0m53.4s/1m0s

running (0m55.0s), 100/100 VUs, 256611 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  0m54.4s/1m0s

running (0m56.0s), 100/100 VUs, 261376 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.4s/1m0s

running (0m57.0s), 100/100 VUs, 266076 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  0m56.4s/1m0s

running (0m58.0s), 100/100 VUs, 270876 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  0m57.4s/1m0s

running (0m59.0s), 100/100 VUs, 275576 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.4s/1m0s

running (1m00.0s), 100/100 VUs, 280253 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  0m59.4s/1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 566506  9344.176174/s
    checks_succeeded...: 100.00% 566506 out of 566506
    checks_failed......: 0.00%   0 out of 566506

    ✓ get 200
    ✓ body has id

    HTTP
    http_req_duration..............: avg=913.04µs min=211.14µs med=825.96µs max=50.91ms p(90)=1.29ms  p(95)=1.48ms  p(99)=1.94ms 
      { expected_response:true }...: avg=913.04µs min=211.14µs med=825.96µs max=50.91ms p(90)=1.29ms  p(95)=1.48ms  p(99)=1.94ms 
    http_req_failed................: 0.00%  0 out of 283553
    http_reqs......................: 283553 4677.036407/s

    EXECUTION
    iteration_duration.............: avg=21.17ms  min=20.26ms  med=21.08ms  max=71.8ms  p(90)=21.61ms p(95)=21.79ms p(99)=22.28ms
    iterations.....................: 283253 4672.088087/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 70 MB  1.2 MB/s
    data_sent......................: 32 MB  534 kB/s



running (1m00.6s), 000/100 VUs, 283253 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s